In [2]:
import pandas as pd
import sqlite3

In [3]:
# Loading cleaned data

df = pd.read_csv("../data/processed/amazon_sales_2025_cleaned.csv", parse_dates=['Date'])

In [4]:
# Creating the database

conn = sqlite3.connect("../data/processed/amazon_sales.db")

df.to_sql("sales", conn, if_exists="replace", index=False)

conn.close()

In [ ]:
# Reopening the connection

conn = sqlite3.connect("../data/processed/amazon_sales.db")
cursor = conn.cursor()

#### Top 10 Categories by Revenue

In [6]:
query = """
SELECT Product_Category, 
       SUM(Total_Sales_INR) AS Revenue
FROM sales
GROUP BY Product_Category
ORDER BY Revenue DESC
LIMIT 10;
"""

pd.read_sql_query(query, conn)

  Product_Category       Revenue
0           Beauty  2.274896e+08
1      Electronics  2.265649e+08
2            Books  2.249992e+08
3         Clothing  2.224093e+08
4   Home & Kitchen  2.166987e+08

#### Return Rate by Payment Method

In [7]:
query = """
SELECT Payment_Method,
       AVG(CASE WHEN Delivery_Status = 'Returned' THEN 1 ELSE 0 END) * 100 AS Return_Rate
FROM sales
GROUP BY Payment_Method
ORDER BY Return_Rate DESC;
"""

pd.read_sql_query(query, conn)

     Payment_Method  Return_Rate
0       Credit Card    33.342105
1        Debit Card    32.707271
2               UPI    32.117389
3  Cash on Delivery    31.983277

#### Daily Revenue

In [8]:
query = """
SELECT Date,
       SUM(Total_Sales_INR) AS Daily_Revenue
FROM sales
GROUP BY Date
ORDER BY Date;
"""

pd.read_sql_query(query, conn).head()

                  Date  Daily_Revenue
0  2025-01-01 00:00:00     3366940.49
1  2025-01-02 00:00:00     3421555.48
2  2025-01-03 00:00:00     3165981.56
3  2025-01-04 00:00:00     3335695.71
4  2025-01-05 00:00:00     3593591.47

#### State-Level Revenue

In [9]:
query = """
SELECT State,
       SUM(Total_Sales_INR) AS Revenue
FROM sales
GROUP BY State
ORDER BY Revenue DESC;
"""

pd.read_sql_query(query, conn)

                State      Revenue
0              Sikkim  43113469.51
1           Rajasthan  42906175.08
2        Chhattisgarh  42857545.27
3           Meghalaya  42773152.96
4          Tamil Nadu  41967968.99
5       Uttar Pradesh  41690917.07
6               Bihar  41669240.44
7         West Bengal  41195932.45
8             Tripura  41103376.81
9              Odisha  40924381.38
10                Goa  40488243.03
11     Madhya Pradesh  39961650.61
12            Manipur  39934040.52
13             Punjab  39640897.69
14          Jharkhand  39606674.07
15  Arunachal Pradesh  39348777.94
16             Kerala  39279218.92
17            Haryana  39171925.41
18          Telangana  39077114.06
19              Assam  38739460.17
20        Maharashtra  38675511.58
21           Nagaland  38670484.69
22            Mizoram  38641789.63
23          Karnataka  38444302.71
24   Himachal Pradesh  38182171.87
25        Uttarakhand  37633617.48
26     Andhra Pradesh  36237577.25
27            Gujarat  36226185.91

#### Most Returned Categories

In [10]:
query = """
SELECT Product_Category,
       AVG(CASE WHEN Delivery_Status = 'Returned' THEN 1 ELSE 0 END) * 100 AS Return_Rate
FROM sales
GROUP BY Product_Category
ORDER BY Return_Rate DESC;
"""

pd.read_sql_query(query, conn)

  Product_Category  Return_Rate
0            Books    33.904448
1      Electronics    33.135705
2         Clothing    32.495036
3           Beauty    31.831832
4   Home & Kitchen    31.271478

In [11]:
# Closing the connection

conn.close()